Documents/ОплатаУслугМВК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОплатаУслугМВК</Name>
			<Comment>Прийняття оплати за надані послуги по Миргородводоканал</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потребитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАванса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СведенияОПроживающихЖильцах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПроживающихЖильцах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проживает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Жилец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОткрытиеЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОткрытиеЛицевогоСчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛицевыеСчета</xr:Item>
				<xr:Item>InformationRegister.ДополнительныеРеквизитыЛицевогоСчета</xr:Item>
				<xr:Item>InformationRegister.ОтветственныйВладелецЛицевогоСчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОплатаУслугМВК/Forms/ФормаДокумента/Ext/Form/Module.bsl
// ПРОЦЕДУРЫ ПРИ ОТКРЫТИИ И ИЗМЕНЕНИИ ШАПКИ ДОКУМЕНТА
//

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////

// ОСНОВНЫЕ ПРОЦЕДУРЫ
//

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	ОтветственныйВладелецИКвоПрописанных                         = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Объект.ЛицевойСчет);
	Объект.Потребитель                                           = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
	Объект.РасшифровкаПлатежа.Очистить();
	
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Здание        = Объект.ЛицевойСчет.Владелец;
	Объект.ОбъектЛицевогоСчета = Объект.Здание.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере();
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
КонецПроцедуры

&НаСервере
Процедура ПотребительПриИзмененииНаСервере()
	Объект.ЛицевойСчет = ОбщийМодульМВК.ПолучитьЛицевойСчет(Объект.Потребитель);
	ОтветственныйВладелецИКвоПрописанных                         = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Объект.ЛицевойСчет);
	Объект.РасшифровкаПлатежа.Очистить();
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Здание        = Объект.ЛицевойСчет.Владелец;
	Объект.ОбъектЛицевогоСчета = Объект.Здание.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ПотребительПриИзменении(Элемент)
	ПотребительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗданиеПриИзмененииНаСервере()
	Объект.ЛицевойСчет = НайтиЛицевойСчетПоЗданию(Объект.Здание);
	ОтветственныйВладелецИКвоПрописанных                         = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Объект.ЛицевойСчет);
	Объект.Потребитель                                           = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
	Объект.РасшифровкаПлатежа.Очистить();
	Объект.Здание        = Объект.ЛицевойСчет.Владелец;
	Объект.ОбъектЛицевогоСчета = Объект.Здание.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	ЗданиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПлатежаПриИзменении(Элемент)
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ПризнакАванса = Истина;
	    НоваяСтрока.Сумма = Объект.СуммаПлатежа;
	Иначе
	    ТекСтр = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	    ТекСтр.Сумма = Объект.СуммаПлатежа;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ФизЛицоПриИзмененииНаСервере()
	// Найдем ЛС
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	СведенияОПроживающихЖильцахСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.СведенияОПроживающихЖильцах.СрезПоследних(&НаДату, &Жилец = Жилец И Проживает = ИСТИНА) КАК СведенияОПроживающихЖильцахСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Жилец", Объект.ФизЛицо);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.ЛицевойСчет = Выборка.ЛицевойСчет;
	КонецЦикла;
	//////// Заполним владельца по ЛС
	ОтветственныйВладелецИКвоПрописанных                         = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Объект.ЛицевойСчет);
	Объект.Потребитель                                           = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
	Объект.РасшифровкаПлатежа.Очистить();
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Здание        = Объект.ЛицевойСчет.Владелец;
	Объект.ОбъектЛицевогоСчета = Объект.Здание.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	ФизЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПредыдущиеПоказанияПриИзменении(Элемент)
	ТекСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.ТекущиеПоказания) Тогда
		ТекСтрока.КвоКубов = ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
		ТекСтрока.Сумма    = ТекСтрока.КвоКубов * ТекСтрока.СтоимостьУслуги;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаТекущиеПоказанияПриИзменении(Элемент)
	ТекСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	ТекСтрока.КвоКубов = ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
	ТекСтрока.Сумма    = ТекСтрока.КвоКубов * ТекСтрока.СтоимостьУслуги;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПризнакАвансаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекущиеДанные.ПризнакАванса Тогда
		ТекущиеДанные.МесяцНачисления = '00010101';	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаМесяцНачисленияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущиеДанные.МесяцНачисления) Тогда
		ТекущиеДанные.ПризнакАванса = Ложь;	
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

// ДРУГИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

&НаСервере
Функция НайтиЛицевойСчетПоЗданию(Здание)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОткрытиеЛицевогоСчета.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
		|	Документ.ОткрытиеЛицевогоСчета КАК ОткрытиеЛицевогоСчета
		|ГДЕ
		|	ОткрытиеЛицевогоСчета.Здание = &Здание";
	Запрос.УстановитьПараметр("Здание", Здание);
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.ЛицевойСчет;
	КонецЦикла;
	Возврат ЛС;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = Справочники.Организации.НайтиПоКоду("000000001");
КонецПроцедуры

&НаСервере
Функция ПроверкаРоли()
    Пользователь = ПараметрыСеанса.ТекущийПользователь.Наименование;
	Возврат Пользователь;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ТолькоПросмотр = Истина;
	Пользователь = ПроверкаРоли();
	Если Пользователь = "Администратор" Тогда
	    ЭтаФорма.ТолькоПросмотр = Ложь;
	ИначеЕсли  Пользователь = "Шевченко Л.В." Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
	ИначеЕсли Пользователь = "Войтенко О.О." Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры
